public class Main {
    public static void main(String[] args) {
//        Задание 2 – Тестирование функций
//
//        Подготовка к выполнению:
//• Создайте новый проект в рабочей IDE;
//• Создайте класс StringUtils, в котором будут находится реализуемые функции;
//• Напишите тесты для реализуемых функций.
//•  Написать тесты к методу, а затем реализовать сам метод по заданной спецификации.
//
//        Напишите метод String keep(String str, String pattern) который оставляет в первой строке
//        все символы, которые присутствуют во второй.
    }
}
