public class Main {
    public static void main(String[] args){
//        Задание 1 – Введение в JUnit
//
// 1 Создаете новый класс и скопируйте код класса Sum;
// 2 Создаете тестовый класс SumTest;
//
// 3 Напишите тест к методу Sum.accum и проверьте его исполнение. Тест должен проверять рабо-
//   тоспособность функции accum.
//
// 4 Очевидно, что если передать слишком большие значения в Sum.accum, то случится переполнение.
//   Модифицируйте функцию Sum.accum, чтобы она возвращала значение типа long и напишите
//   новый тест, проверяющий корректность работы функции с переполнением. Первый тест
//   должен работать корректно.

    }
}
